using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleApp5BodyWeightIndex
{
    class Program
    {
        /// <summary>
        /// Задача 5.
        /// а) Написать программу, которая запрашивает массу и рост человека, вычисляет его индекс массы и
        /// сообщает, нужно ли человеку похудеть, набрать вес или всё в норме.
        /// б) *Рассчитать, на сколько кг похудеть или сколько кг набрать для нормализации веса.
        /// Рассахатский
        /// </summary>
        static void Main()
        {
            MyHelper.MyHeader(text:"Задача 5. Программа индекс массы тела с рекомендациями по приведению ИМТ к норме.");
            ///////////////////////////////////////////////////////////////////////////////////




            ///////////////////////////////////////////////////////////////////////////////////
            MyHelper.MyFooter();
        }
    }
}
