using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleApp1LoginPassword
{
    class Program
    {
        /// <summary>
        /// Задача 1
        /// Создать программу, которая будет проверять корректность ввода логина. Корректным логином будет строка от 2 до 10 символов,
        /// содержащая только буквы латинского алфавита или цифры, при этом цифра не может быть первой:
        /// а) без использования регулярных выражений;
        /// б) **с использованием регулярных выражений.
        /// Рассахатский
        /// </summary>
        static void Main()
        {
            MyHelper.MyHeader(text: "Задача 1. Проверка корректности ввода логина. ");
            ///////////////////////////////////////////////////////////////////////////////////



            ///////////////////////////////////////////////////////////////////////////////////
            MyHelper.MyFooter();
        }
    }
}
