using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using static System.Console;

namespace ConsoleApp2Numbers
{
    class Program
    {
        /// <summary>
        /// Задача 2.
        /// а) С клавиатуры вводятся числа, пока не будет введен 0 (каждое число в новой строке).
        /// Требуется подсчитать сумму всех нечетных положительных чисел. Сами числа и сумму
        /// вывести на экран, используя tryParse;
        /// б) Добавить обработку исключительных ситуаций на то, что могут быть введены некорректные
        /// данные. При возникновении ошибки вывести сообщение. Напишите соответствующую функцию;
        /// Рассахатский
        /// </summary>
        static void Main()
        {
            MyHelper.MyHeader(text: "Задача 2. С клавиатуры вводятся числа, пока не будет введен 0.");
            ///////////////////////////////////////////////////////////////////////////////////



            ///////////////////////////////////////////////////////////////////////////////////
            MyHelper.MyFooter();

        }



        /// <summary>
        /// Определение что это хорошее число - нечетное и положительное
        /// </summary>
        /// <param name="num">число</param>
        /// <returns>является хорошим числом</returns>
        public static bool isGoodNumber(int num) => num % 2 != 0 && num > 0;

    }
}
